app/views/products/index.html.erb

<script type="text/javascript" charset="utf-8">
$(function() {
  $(".js-more").on("click", function() {

    var id = $(this).data("id");
    $.get("/products/" + id + ".json", function(product) {
      console.log(product["inventory"])
      var inventoryText = "<strong>Available</strong>";
      if(product["inventory"] === 0){
          console.log(product["inventory"])
          inventoryText = "<strong>Sold Out</strong>";
        }

      var descriptionText = "<p>" + product["description"] + "</p><p>" + inventoryText + "</p>";
      $("#product-" + id).html(descriptionText);

      var orderList = "";
      var orders = product["orders"];
      orders.forEach(function(order) {
        orderList += '<li class="js-order" data-id="' + order["id"] + '">' + order["id"] + ' - ' + order["created_at"];
        orderList += ' <br>Products:<ol>';
        products = order["products"];
---
SELECT "products".* FROM "products"